app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["user_id", 1], ["created_at", "2019-11-29 07:31:22.112753"], ["updated_at", "2019-11-29 07:31:22.112753"]]
---
  def create
    @category = current_user.categories.build(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Bakery"], ["updated_at", "2019-12-01 14:59:45.330813"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)