app/controllers/holidays_controller.rb

SELECT "holidays".* FROM "holidays"
---
  def index
    @holidays = Holiday.all

INSERT INTO "holidays" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Saturday"], ["user_id", 1], ["created_at", "2019-11-29 07:49:52.651233"], ["updated_at", "2019-11-29 07:49:52.651233"]]
---
  def create
    @holiday = current_user.holidays.build(holiday_params)

    respond_to do |format|
      if @holiday.save

UPDATE "holidays" SET "name" = ?, "updated_at" = ? WHERE "holidays"."id" = ?  [["name", "Saturday Only"], ["updated_at", "2019-12-01 15:20:45.301774"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @holiday.update(holiday_params)

SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_holiday
      @holiday = Holiday.find(params[:id])