app/controllers/places_controller.rb

INSERT INTO "places" ("name", "user_id", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)
---
  def create
    @place = current_user.places.build(place_params)

    respond_to do |format|
      if @place.save