app/controllers/public_holidays_controller.rb

SELECT "public_holidays".* FROM "public_holidays"
---
  def index
    @public_holidays = PublicHoliday.all

INSERT INTO "public_holidays" ("status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["status", "Closed"], ["user_id", 1], ["created_at", "2019-12-01 15:31:13.822849"], ["updated_at", "2019-12-01 15:31:13.822849"]]
---
  def create
    @public_holiday = current_user.public_holidays.build(public_holiday_params)

    respond_to do |format|
      if @public_holiday.save

SELECT  "public_holidays".* FROM "public_holidays" WHERE "public_holidays"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_public_holiday
      @public_holiday = PublicHoliday.find(params[:id])