app/controllers/stores_controller.rb

  def index
    @stores = Store.all.order('created_at DESC').where(["name like ?", "%#{params[:search]}%"]).paginate(page: params[:page], per_page: 12)
---
SELECT  "stores".* FROM "stores" WHERE (name like '%%') ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]