app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores" WHERE (name like '%%') ORDER BY created_at ASSC LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stores" WHERE (name like '%%')
---
  def index
    @stores = Store.all.where(["name like ?", "%#{params[:search]}%"]).paginate(page: params[:page], per_page: 9)

INSERT INTO "stores" ("name", "contact", "description", "opening", "closing", "coordinates", "category_id", "user_id", "holiday_id", "created_at", "updated_at", "place_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @store = current_user.stores.build(store_params)

    respond_to do |format|
      if @store.save

UPDATE "stores" SET "name" = ?, "coordinates" = ?, "holiday_id" = ?, "opening" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["name", "PERODUA"], ["coordinates", "3.6988,101.5140"], ["holiday_id", 18], ["opening", "2000-01-01 08:00:00"], ["updated_at", "2019-12-01 16:39:08.341851"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @store.update(store_params)